// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
